AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ЦеныОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЦеныОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалогаВСумке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаВСумке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ПросмотрИзделийНаСкладах/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда 
			СотрудникЦО = Истина;
		КонецЕсли;	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
	    Дата = ТекущаяДатаСеанса(); 
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
	    Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	КонецЕсли;        
	
	Если ТекПользователь.ЭтоЛомбард Тогда 
		Ломбард = ПараметрыСеанса.ТекущийЛомбард; 
		Элементы.Ломбард.Доступность = Ложь;
		Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		Элементы.ПеремещениеЗалогов.Видимость = Ложь; 
		Элементы.НазначитьГруппу.Видимость = Ложь;
		Элементы.УстановитьЦены.Видимость = Ложь;   		
		ОтбиратьПо = 0;
		Элементы.ОтбиратьПо.Доступность = Ложь;   
		ЗаполнитьТаблицуНаСервере();
	Иначе
		УстановитьОтбиратьПо();
		//lion+++ 13.08.2025
		Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		Элементы.Склад.СписокВыбора.Очистить();
		//Если НЕ ЗначениеЗаполнено(Ломбард) Тогда
		//    Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);  
		//	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());  
		//КонецЕсли; 
		//lion--- 13.08.2025
	КонецЕсли;	 
	Если НЕ СотрудникЦО Тогда
		Элементы.ТаблицаТоваровИзъятие.Видимость = Ложь; 
		Элементы.ТаблицаТоваровОтменаИзъятия.Видимость = Ложь; 
		Элементы.ТаблицаТоваровВозвратИзъятого.Видимость = ложь; 
		Элементы.ТаблицаТоваровОтменаВозвратаИзъятого.Видимость = ложь;  
		Элементы.ТаблицаТоваровГруппаОтчеты.ПодчиненныеЭлементы.ТаблицаТоваровИсторияЗалога.Видимость = ложь;
	ИначеЕсли НЕ Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
		Элементы.ТаблицаТоваровИзъятие.Видимость = Ложь; 
		Элементы.ТаблицаТоваровОтменаИзъятия.Видимость = Ложь; 
		Элементы.ТаблицаТоваровВозвратИзъятого.Видимость = ложь; 
		Элементы.ТаблицаТоваровОтменаВозвратаИзъятого.Видимость = ложь;
	КонецЕсли;	
	УстановитьВидимостьКолонок();
		
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеЗалогов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОприходованиеЗалогов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьГруппу(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_НазначениеГруппыОбъектамЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПодразделений()  
	СписокПодразделений = Новый СписокЗначений;
	Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		СписокПодразделений.Добавить(Ломбард);
	ИначеЕсли ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), Ломбард);
	КонецЕсли;
	Возврат СписокПодразделений;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Организация", Организация);  
	Условие = ""; 
	УсловиеСумка = "";
	Если ЗначениеЗаполнено(Ломбард) Тогда  
		Запрос.УстановитьПараметр("Подразделения", ПолучитьСписокПодразделений());
        Условие = Условие + " И Ломбард В (&Подразделения)"; 
		УсловиеСумка = УсловиеСумка + " И Получатель В (&Подразделения)";
	КонецЕсли;	  
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.УстановитьПараметр("Склад", Склад);  
		Условие = Условие + " И Склад = &Склад";
        УсловиеСумка = УсловиеСумка + " И СкладПолучатель = &Склад"; 
	Иначе     
		Запрос.УстановитьПараметр("ПустойСклад", Справочники.ЛБ_Склады.ПустаяСсылка());
		Условие = Условие + " И НЕ Склад = &ПустойСклад"; 
		УсловиеСумка = УсловиеСумка + " И НЕ СкладПолучатель = &ПустойСклад";  //" + Условие + "     " + УсловиеСумка + "
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	               |	ЛОЖЬ КАК ВСумке,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Период КАК ДатаЦены
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, Организация = &Организация" + Условие + ") КАК ЛБ_ОбъектыЗалогаОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Получатель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки,
	               |	1,
	               |	ИСТИНА,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Период
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаВСумке.Остатки(&Дата, Организация = &Организация" + УсловиеСумка + ") КАК ЛБ_ОбъектыЗалогаВСумкеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВСумкеОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВСумкеОстатки.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВСумкеОстатки.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса);  
	
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");        
	ИтогВесИзделия = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
	ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс");
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");      
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды");  
	ИтогЦена = ТаблицаТоваров.Итог("Цена");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса(); 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуНаТекущуюДату(Команда)
	Дата = ПолучитьТекущуюДатуСеанса();
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбиратьПо()
	Если ОтбиратьПо = 0 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);		
		Элементы.Склад.ТолькоПросмотр = Ложь;   
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		КонецЕсли;	
	ИначеЕсли ОтбиратьПо = 1 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_ОтделенияЛомбардов";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр); 
		Элементы.Склад.ТолькоПросмотр = Истина; 
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбард = Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;	
	Значение = Элементы.Ломбард;
    Элементы.Ломбард.ОграничениеТипа.ПривестиЗначение(Значение);
    Элементы.Ломбард.ВыбиратьТип = Ложь; 
	Элементы.Склад.СписокВыбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоПриИзменении(Элемент)
	УстановитьОтбиратьПо();               
	Склад = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка"); 
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	МассивСкладов = Новый Массив;
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос; 
		Запрос.УстановитьПараметр("Владелец", Ломбард);
		//+МАН 25.12.25 Изменил запрос. Заявка 3269
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ЛБ_Склады.Ссылка КАК Ссылка
		//               |ИЗ
		//               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		//               |ГДЕ
		//               |	ЛБ_Склады.Владелец = &Владелец";
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И НЕ (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		//-МАН
		Выборка = Запрос.Выполнить().Выбрать();     
		Пока Выборка.Следующий() Цикл 
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;	
	КонецЕсли;
	Возврат МассивСкладов;
КонецФункции

&НаСервере
Процедура УстановитьВидимостьКолонок() 
	Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") И ЗначениеЗаполнено(Ломбард) Тогда 
		Элементы.ТаблицаТоваровЛомбард.Видимость = Ложь;
		Элементы.ТаблицаТоваровСклад.Видимость = Ложь;
	Иначе 
		Элементы.ТаблицаТоваровЛомбард.Видимость = Истина;
		Элементы.ТаблицаТоваровСклад.Видимость = Истина;
	КонецЕсли;	   
	
	Если ЗначениеЗаполнено(Склад) Тогда 
	    Элементы.ТаблицаТоваровСклад.Видимость = Ложь;
	Иначе 
		Элементы.ТаблицаТоваровСклад.Видимость = Истина;
	КонецЕсли;	   
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов()); 
	Если СотрудникЦО Тогда
		Если Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
			Элементы.ТаблицаТоваровИзъятие.Видимость = Истина; 
			Элементы.ТаблицаТоваровОтменаИзъятия.Видимость = Истина;  
			Элементы.ТаблицаТоваровВозвратИзъятого.Видимость = Истина; 
		    Элементы.ТаблицаТоваровОтменаВозвратаИзъятого.Видимость = Истина;
		Иначе
			Элементы.ТаблицаТоваровИзъятие.Видимость = Ложь;      
			Элементы.ТаблицаТоваровОтменаИзъятия.Видимость = Ложь;
			Элементы.ТаблицаТоваровВозвратИзъятого.Видимость = ложь; 
		    Элементы.ТаблицаТоваровОтменаВозвратаИзъятого.Видимость = ложь;
		КонецЕсли;
	КонецЕсли;	
	УстановитьВидимостьКолонок();    
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстановитьВидимостьКолонок();
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаТоваров.НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ЗалоговыйБилет);
	СтруктураВ.Вставить("Залогодатель", Стр.ЗалоговыйБилет.Залогодатель); 
	СтруктураВ.Вставить("НомерЗБ", Стр.ЗалоговыйБилет.НомерЗалоговогоБилета);
	Возврат СтруктураВ;
КонецФункции	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладДляУстановкиЦены() 
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда 
		Если Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
		    ВидСклада = Перечисления.ЛБ_ВидыСкладов.ВитринаОбщая;
		Иначе    
			ВидСклада = Перечисления.ЛБ_ВидыСкладов.Витрина;
		КонецЕсли;	
        Возврат ЛБ_Общиймодуль.ПолучитьСклад(Ломбард, ВидСклада);
	КонецЕсли;	
	Возврат неопределено;
КонецФункции	
	 
&НаКлиенте
Процедура УстановитьЦены(Команда)  
	СкладДляУстановкиЦены = ПолучитьСкладДляУстановкиЦены();
	Если ЗначениеЗаполнено(Ломбард) Тогда  
		Если СкладДляУстановкиЦены = неопределено Тогда 
			Предупреждение("Для подразделения " + СокрЛП(Ломбард) + " не определен склад с видом " + ?(Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"), "«Витрина общая»", "«Витрина ломбарда/ЦЛО»"));
		Иначе	
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Склад", СкладДляУстановкиЦены); 
			ОткрытьФорму("Документ.ЛБ_УстановкаЦены.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		КонецЕсли;
	Иначе   
	   	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСклада",ЭтаФорма); 
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборСкладаДляУстановкиЦен",, ЭтаФорма,,,, ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораСклада(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Результат); 
	ОткрытьФорму("Документ.ЛБ_УстановкаЦены.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры

&НаКлиенте
Процедура Реализация(Команда)
	ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

//lion+++ 13.08.2025
&НаСервере
Функция ТекущийПользовательЭтоЛомбард()
	возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТекущийПользовательЭтоЛомбард() Тогда 
		//Ломбард = ПараметрыСеанса.ТекущийЛомбард; 
		//Элементы.Ломбард.Доступность = Ложь;
		//Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		//Элементы.ПеремещениеЗалогов.Видимость = Ложь; 
		//Элементы.НазначитьГруппу.Видимость = Ложь;
		//Элементы.УстановитьЦены.Видимость = Ложь;  
		//ОтбиратьПо = 0;
		//Элементы.ОтбиратьПо.Доступность = Ложь;   
		//ЗаполнитьТаблицуНаСервере();
	Иначе
		//УстановитьОтбиратьПо();
		Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		Элементы.Склад.СписокВыбора.Очистить();
		//Если НЕ ЗначениеЗаполнено(Ломбард) Тогда
		//    Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);  
		//	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());  
		//КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры 

//lion--- 13.08.2025

&НаСервере
Функция ПроверитьПередИзъятием(ЗалоговыйБилет)
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ЦентральныйОфис); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	               |			,
	               |			Ломбард = &Ломбард
	               |				И ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ЕстьИзделия = Ложь;
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Если НЕ Стр.Количество = 0 Тогда 
			ЕстьИзделия = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;
	
	Возврат ЕстьИзделия;
КонецФункции

&НаСервере
Функция ПроверитьПередОтменойИзъятия()
	ТекДата = ТекущаяДатаСеанса();
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекДата));  
	Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ЦентральныйОфис);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ДокументЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК Номер
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога)
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард = &Ломбард"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


&НаКлиенте
Процедура Изъятие(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		Если НЕ ПроверитьПередИзъятием(Результат.ЗБ) Тогда   
			Если ТекСтрока.ВСумке Тогда
				ТекстПредупреждения = "Изделие " + СокрЛП(ТекСтрока.ВидИзделия) + " арт. " + СокрЛП(ТекСтрока.Артикул) + " находится на складе " + СокрЛП(ТекСтрока.Склад) + " в сумке. Изятие невозможно."
			Иначе	
			    ТекстПредупреждения = "Объекты залога из залогового билета № " + СокрЛП(Результат.НомерЗБ) + " в ЦО не найдены. Изятие невозможно."; 
			КонецЕсли;	
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
		КонецЕсли;	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);
		ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
								
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаИзъятия(Команда) 
	Если НЕ ПроверитьПередОтменойИзъятия() Тогда
		Предупреждение("Не найдены документы изъятия из ЦО для которых возможна операция отмены.", 60);    
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗайму", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗайму(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		//+МАН Изменил т.к. не тем сравнивается.
		//Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
		Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда
		//-МАН
			//+МАН 13.03.26 Изменил сообщение. Заявка 3654.
			//Предупреждение("Вид последней операции с ЗБ " + СокрЛП(Результат.НомерЗалоговогоБилета) + " не изъятие объектов залога. Отмена изъятия не возможна!");  
			Предупреждение("Отмена изъятого по ЗБ №" + СокрЛП(Результат.НомерЗалоговогоБилета) + " невозможна, т.к. операция уже была отменена.");  
			//-МАН
			Возврат;
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ); 
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(НомерЗалоговогоБилета, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, Дата, Истина);
	
	ИнформацияОЗБ = Новый Структура;
	ИнформацияОЗБ.Вставить("Документ", Результат.Регистратор);
	ИнформацияОЗБ.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	
	Возврат ИнформацияОЗБ;
	
КонецФункции

&НаКлиенте
Процедура ВозвратИзъятого(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога"));
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВозвратаИзъятие", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВозвратаИзъятие(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
		ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
										
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПроверитьПередОтменойВозвратаИзъятия()
	ТекДата = ТекущаяДатаСеанса();
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекДата));  
	Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ЦентральныйОфис);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ДокументЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК Номер
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога)
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард = &Ломбард"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


&НаКлиенте
Процедура ОтменаВозвратаИзъятого(Команда)
	Если НЕ ПроверитьПередОтменойВозвратаИзъятия() Тогда
		Предупреждение("Не найдены документы возврата изъятого в ЦО для которых возможна операция отмены.", 60);    
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
	ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗаймуВозврат", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗаймуВозврат(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());   
		Если НЕ ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
			//+МАН 13.03.26 Изменил сообщение. Заявка 3654.
			//Предупреждение("Вид последней операции с ЗБ " + СокрЛП(Результат.НомерЗалоговогоБилета) + " не возврат изъятых объектов залога. Отмена возврата изъятого не возможна!");  
			Предупреждение("Отмена возврата изъятого по ЗБ №" + СокрЛП(Результат.НомерЗалоговогоБилета) + " невозможна, т.к. операция уже была отменена.");  
			//-МАН
			Возврат;
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);
		
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуОтгрузки(ЗалоговыйБилет, ОбъектЗалога)  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК ДатаНач
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНач УБЫВ";
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
			Возврат Выборка.ДатаНач;
		КонецЕсли;	
	КонецЕсли;	                    
	Возврат Дата(1,1,1);
КонецФункции    

&НаСервере
Функция ПолучитьНомерЗБ(ЗалоговыйБилет) 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции	  

&НаКлиенте
Процедура ИсторияЗалога(Команда) 
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		НомерЗБ = ПолучитьНомерЗБ(ТекСтрока.ЗалоговыйБилет);
		Если ПолучитьДатуОтгрузки(ТекСтрока.ЗалоговыйБилет, ТекСтрока.ОбъектЗалога) = Дата(1,1,1) Тогда  
			Предупреждение("Залоговый билет № " + СокрЛП(НомерЗБ) + " не был отгружен из ломбарда", 60);
        Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
			ПараметрыФормы.Вставить("ОбъектЗалога", ТекСтрока.ОбъектЗалога);	
									
			ОткрытьФорму("Отчет.ЛБ_ИсторияДвиженияОбъектаЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	 
	Иначе
		Предупреждение("Для формирования отчета выберите изделие в табличной части формы", 60);
	КонецЕсли;	
КонецПроцедуры
